# AddExternallyTaggedGeometry Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DirectShapeType..::..AddExternallyTaggedGeometry Method
DirectShapeType Class See Also
---
Adds the externally tagged geometry object to the DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void AddExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
```

Visual Basic
---
```text
Public Sub AddExternallyTaggedGeometry ( _
	externallyTaggedGeometry As ExternallyTaggedGeometryObject _
)
```

Visual C++
---
```text
public:
void AddExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
```

# ### Parameters
externallyTaggedGeometry
    Type: Autodesk.Revit.DB..::..ExternallyTaggedGeometryObject The externally tagged geometry that should be added to the DirectShapeType.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The externallyTaggedGeometry has already been added to this DirectShapeType. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace